Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
        <register caption="Interrupt Pending Register 1" name="AIC_IPR1" offset="0x24" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="PID32"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="PID33"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="PID34"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="PID35"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="PID36"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="PID37"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="PID38"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="PID39"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="PID40"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="PID41"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="PID42"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="PID43"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="PID44"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="PID45"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="PID46"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="PID47"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="PID48"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="PID49"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="PID50"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="PID51"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="PID52"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="PID53"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="PID54"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="PID55"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="PID56"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="PID58"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="PID59"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="PID60"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="PID61"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="PID62"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="PID63"/>
        </register>
        <register caption="Interrupt Pending Register 2" name="AIC_IPR2" offset="0x28" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="PID64"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="PID65"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="PID66"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="PID67"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="PID68"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="PID69"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="PID70"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="PID71"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="PID72"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="PID73"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="SYS"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="PID75"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="PID76"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="PID77"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="PID78"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="PID79"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="PID80"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="PID81"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="PID82"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="PID83"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="PID84"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="PID85"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="PID86"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="PID87"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="PID88"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="PID89"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="PID90"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="PID91"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="PID92"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="PID93"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="PID94"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="PID95"/>
        </register>
        <register caption="Interrupt Pending Register 3" name="AIC_IPR3" offset="0x2C" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="PID96"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="PID97"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="PID98"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="PID99"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="PID100"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="PID101"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="PID102"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="PID103"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="PID104"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="PID105"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="PID106"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="PID107"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="PID108"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="PID109"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="PID110"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="PID111"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="PID112"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="PID113"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="PID114"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="PID115"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="PID116"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="PID117"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="PID118"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="PID119"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="PID120"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="PID121"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="PID122"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="PID123"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="PID124"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="PID125"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="PID126"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="PID127"/>
        </register>
        <register caption="Interrupt Mask Register" name="AIC_IMR" offset="0x30" rw="R" size="4">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="INTM"/>
        </register>
        <register caption="Core Interrupt Status Register" name="AIC_CISR" offset="0x34" rw="R" size="4">
          <bitfield caption="NFIQ Status" mask="0x00000001" name="NFIQ"/>
          <bitfield caption="NIRQ Status" mask="0x00000002" name="NIRQ"/>
        </register>
        <register caption="End of Interrupt Command Register" name="AIC_EOICR" offset="0x38" rw="W" size="4">
          <bitfield caption="Interrupt Processing Complete Command" mask="0x00000001" name="ENDIT"/>
        </register>
        <register caption="Spurious Interrupt Vector Register" name="AIC_SPU" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Spurious Interrupt Vector Register" mask="0xFFFFFFFF" name="SIVR"/>
        </register>
