Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
        <register caption="USART Baud Rate Generator Register" name="FLEX_US_BRGR" offset="0x220" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="USART Receiver Timeout Register" name="FLEX_US_RTOR" offset="0x224" rw="RW" size="4">
          <bitfield caption="Timeout Value" mask="0x0001FFFF" name="TO"/>
        </register>
        <register caption="USART Transmitter Timeguard Register" name="FLEX_US_TTGR" offset="0x228" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="USART FI DI Ratio Register" name="FLEX_US_FIDI" offset="0x240" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x0000FFFF" name="FI_DI_RATIO"/>
        </register>
        <register caption="USART Number of Errors Register" name="FLEX_US_NER" offset="0x244" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="USART IrDA Filter Register" name="FLEX_US_IF" offset="0x24C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="USART Manchester Configuration Register" name="FLEX_US_MAN" offset="0x250" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="FLEX_US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="FLEX_US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift Compensation" mask="0x40000000" name="DRIFT"/>
          <bitfield caption="Receiver Idle Value" mask="0x80000000" name="RXIDLEV"/>
        </register>
        <register caption="USART LIN Mode Register" name="FLEX_US_LINMR" offset="0x254" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="FLEX_US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="DMAC Mode" mask="0x00010000" name="PDCM"/>
          <bitfield caption="Synchronization Disable" mask="0x00020000" name="SYNCDIS"/>
        </register>
        <register caption="USART LIN Identifier Register" name="FLEX_US_LINIR" offset="0x258" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="USART LIN Baud Rate Register" name="FLEX_US_LINBRR" offset="0x25C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="USART Comparison Register" name="FLEX_US_CMPR" offset="0x290" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000001FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="FLEX_US_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x01FF0000" name="VAL2"/>
        </register>
        <register caption="USART FIFO Mode Register" name="FLEX_US_FMR" offset="0x2A0" rw="RW" size="4">
          <bitfield caption="Transmitter Ready Mode" mask="0x00000003" name="TXRDYM" values="FLEX_US_FMR__TXRDYM"/>
          <bitfield caption="Receiver Ready Mode" mask="0x00000030" name="RXRDYM" values="FLEX_US_FMR__RXRDYM"/>
          <bitfield caption="FIFO RTS Pin Control enable (Hardware Handshaking mode only)" mask="0x00000080" name="FRTSC"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x00003F00" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x003F0000" name="RXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold 2" mask="0x3F000000" name="RXFTHRES2"/>
        </register>
        <register caption="USART FIFO Level Register" name="FLEX_US_FLR" offset="0x2A4" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="USART FIFO Interrupt Enable Register" name="FLEX_US_FIER" offset="0x2A8" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Enable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Enable" mask="0x00000200" name="RXFTHF2"/>
        </register>
        <register caption="USART FIFO Interrupt Disable Register" name="FLEX_US_FIDR" offset="0x2AC" rw="W" size="4">
          <bitfield caption="TXFEF Interrupt Disable" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Disable" mask="0x00000200" name="RXFTHF2"/>
        </register>
        <register caption="USART FIFO Interrupt Mask Register" name="FLEX_US_FIMR" offset="0x2B0" rw="R" size="4">
          <bitfield caption="TXFEF Interrupt Mask" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="RXFTHF2 Interrupt Mask" mask="0x00000200" name="RXFTHF2"/>
        </register>
