Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
        <register caption="Raw Interrupt Status Register" name="L2CC_RISR" offset="0x21C" rw="R" size="4">
          <bitfield caption="Event Counter 1/0 Overflow Increment" mask="0x00000001" name="ECNTR"/>
          <bitfield caption="Parity Error on L2 Tag RAM, Read" mask="0x00000002" name="PARRT"/>
          <bitfield caption="Parity Error on L2 Data RAM, Read" mask="0x00000004" name="PARRD"/>
          <bitfield caption="Error on L2 Tag RAM, Write" mask="0x00000008" name="ERRWT"/>
          <bitfield caption="Error on L2 Data RAM, Write" mask="0x00000010" name="ERRWD"/>
          <bitfield caption="Error on L2 Tag RAM, Read" mask="0x00000020" name="ERRRT"/>
          <bitfield caption="Error on L2 Data RAM, Read" mask="0x00000040" name="ERRRD"/>
          <bitfield caption="SLVERR from L3 memory" mask="0x00000080" name="SLVERR"/>
          <bitfield caption="DECERR from L3 memory" mask="0x00000100" name="DECERR"/>
        </register>
        <register caption="Interrupt Clear Register" name="L2CC_ICR" offset="0x220" rw="RW" size="4">
          <bitfield caption="Event Counter 1/0 Overflow Increment" mask="0x00000001" name="ECNTR"/>
          <bitfield caption="Parity Error on L2 Tag RAM, Read" mask="0x00000002" name="PARRT"/>
          <bitfield caption="Parity Error on L2 Data RAM, Read" mask="0x00000004" name="PARRD"/>
          <bitfield caption="Error on L2 Tag RAM, Write" mask="0x00000008" name="ERRWT"/>
          <bitfield caption="Error on L2 Data RAM, Write" mask="0x00000010" name="ERRWD"/>
          <bitfield caption="Error on L2 Tag RAM, Read" mask="0x00000020" name="ERRRT"/>
          <bitfield caption="Error on L2 Data RAM, Read" mask="0x00000040" name="ERRRD"/>
          <bitfield caption="SLVERR from L3 memory" mask="0x00000080" name="SLVERR"/>
          <bitfield caption="DECERR from L3 memory" mask="0x00000100" name="DECERR"/>
        </register>
        <register caption="Cache Synchronization Register" name="L2CC_CSR" offset="0x730" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
        </register>
        <register caption="Invalidate Physical Address Line Register" name="L2CC_IPALR" offset="0x770" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
          <bitfield caption="Index Number" mask="0x00003FE0" name="IDX"/>
          <bitfield caption="Tag Number" mask="0xFFFFC000" name="TAG"/>
        </register>
        <register caption="Invalidate Way Register" name="L2CC_IWR" offset="0x77C" rw="RW" size="4">
          <bitfield caption="Invalidate Way Number 0" mask="0x00000001" name="WAY0"/>
          <bitfield caption="Invalidate Way Number 1" mask="0x00000002" name="WAY1"/>
          <bitfield caption="Invalidate Way Number 2" mask="0x00000004" name="WAY2"/>
          <bitfield caption="Invalidate Way Number 3" mask="0x00000008" name="WAY3"/>
          <bitfield caption="Invalidate Way Number 4" mask="0x00000010" name="WAY4"/>
          <bitfield caption="Invalidate Way Number 5" mask="0x00000020" name="WAY5"/>
          <bitfield caption="Invalidate Way Number 6" mask="0x00000040" name="WAY6"/>
          <bitfield caption="Invalidate Way Number 7" mask="0x00000080" name="WAY7"/>
        </register>
        <register caption="Clean Physical Address Line Register" name="L2CC_CPALR" offset="0x7B0" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
          <bitfield caption="Index number" mask="0x00003FE0" name="IDX"/>
          <bitfield caption="Tag number" mask="0xFFFFC000" name="TAG"/>
        </register>
        <register caption="Clean Index Register" name="L2CC_CIR" offset="0x7B8" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
          <bitfield caption="Index number" mask="0x00003FE0" name="IDX"/>
          <bitfield caption="Way number" mask="0x70000000" name="WAY"/>
        </register>
        <register caption="Clean Way Register" name="L2CC_CWR" offset="0x7BC" rw="RW" size="4">
          <bitfield caption="Clean Way Number 0" mask="0x00000001" name="WAY0"/>
          <bitfield caption="Clean Way Number 1" mask="0x00000002" name="WAY1"/>
          <bitfield caption="Clean Way Number 2" mask="0x00000004" name="WAY2"/>
          <bitfield caption="Clean Way Number 3" mask="0x00000008" name="WAY3"/>
          <bitfield caption="Clean Way Number 4" mask="0x00000010" name="WAY4"/>
          <bitfield caption="Clean Way Number 5" mask="0x00000020" name="WAY5"/>
          <bitfield caption="Clean Way Number 6" mask="0x00000040" name="WAY6"/>
          <bitfield caption="Clean Way Number 7" mask="0x00000080" name="WAY7"/>
        </register>
        <register caption="Clean Invalidate Physical Address Line Register" name="L2CC_CIPALR" offset="0x7F0" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
          <bitfield caption="Index Number" mask="0x00003FE0" name="IDX"/>
          <bitfield caption="Tag Number" mask="0xFFFFC000" name="TAG"/>
        </register>
        <register caption="Clean Invalidate Index Register" name="L2CC_CIIR" offset="0x7F8" rw="RW" size="4">
          <bitfield caption="Cache Synchronization Status" mask="0x00000001" name="C"/>
          <bitfield caption="Index Number" mask="0x00003FE0" name="IDX"/>
          <bitfield caption="Way Number" mask="0x70000000" name="WAY"/>
        </register>
        <register caption="Clean Invalidate Way Register" name="L2CC_CIWR" offset="0x7FC" rw="RW" size="4">
          <bitfield caption="Clean Invalidate Way Number 0" mask="0x00000001" name="WAY0"/>
          <bitfield caption="Clean Invalidate Way Number 1" mask="0x00000002" name="WAY1"/>
          <bitfield caption="Clean Invalidate Way Number 2" mask="0x00000004" name="WAY2"/>
          <bitfield caption="Clean Invalidate Way Number 3" mask="0x00000008" name="WAY3"/>
          <bitfield caption="Clean Invalidate Way Number 4" mask="0x00000010" name="WAY4"/>
          <bitfield caption="Clean Invalidate Way Number 5" mask="0x00000020" name="WAY5"/>
          <bitfield caption="Clean Invalidate Way Number 6" mask="0x00000040" name="WAY6"/>
          <bitfield caption="Clean Invalidate Way Number 7" mask="0x00000080" name="WAY7"/>
        </register>
        <register caption="Data Lockdown Register" name="L2CC_DLKR" offset="0x900" rw="RW" size="4">
          <bitfield caption="Data Lockdown in Way Number 0" mask="0x00000001" name="DLK0"/>
          <bitfield caption="Data Lockdown in Way Number 1" mask="0x00000002" name="DLK1"/>
          <bitfield caption="Data Lockdown in Way Number 2" mask="0x00000004" name="DLK2"/>
          <bitfield caption="Data Lockdown in Way Number 3" mask="0x00000008" name="DLK3"/>
          <bitfield caption="Data Lockdown in Way Number 4" mask="0x00000010" name="DLK4"/>
          <bitfield caption="Data Lockdown in Way Number 5" mask="0x00000020" name="DLK5"/>
          <bitfield caption="Data Lockdown in Way Number 6" mask="0x00000040" name="DLK6"/>
          <bitfield caption="Data Lockdown in Way Number 7" mask="0x00000080" name="DLK7"/>
        </register>
        <register caption="Instruction Lockdown Register" name="L2CC_ILKR" offset="0x904" rw="RW" size="4">
          <bitfield caption="Instruction Lockdown in Way Number 0" mask="0x00000001" name="ILK0"/>
          <bitfield caption="Instruction Lockdown in Way Number 1" mask="0x00000002" name="ILK1"/>
          <bitfield caption="Instruction Lockdown in Way Number 2" mask="0x00000004" name="ILK2"/>
          <bitfield caption="Instruction Lockdown in Way Number 3" mask="0x00000008" name="ILK3"/>
          <bitfield caption="Instruction Lockdown in Way Number 4" mask="0x00000010" name="ILK4"/>
          <bitfield caption="Instruction Lockdown in Way Number 5" mask="0x00000020" name="ILK5"/>
          <bitfield caption="Instruction Lockdown in Way Number 6" mask="0x00000040" name="ILK6"/>
          <bitfield caption="Instruction Lockdown in Way Number 7" mask="0x00000080" name="ILK7"/>
        </register>
