Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
        <register caption="Maximum Current Capabilities Register" name="SDMMC_MCCAR" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Current for 3.3V" mask="0x000000FF" name="MAXCUR33V"/>
          <bitfield caption="Maximum Current for 3.0V" mask="0x0000FF00" name="MAXCUR30V"/>
          <bitfield caption="Maximum Current for 1.8V" mask="0x00FF0000" name="MAXCUR18V"/>
        </register>
        <register caption="Force Event Register for Auto CMD Error Status" name="SDMMC_FERACES" offset="0x50" rw="W" size="2">
          <bitfield caption="Force Event for Auto CMD12 Not Executed" mask="0x00000001" name="ACMD12NE"/>
          <bitfield caption="Force Event for Auto CMD Timeout Error" mask="0x00000002" name="ACMDTEO"/>
          <bitfield caption="Force Event for Auto CMD CRC Error" mask="0x00000004" name="ACMDCRC"/>
          <bitfield caption="Force Event for Auto CMD End Bit Error" mask="0x00000008" name="ACMDEND"/>
          <bitfield caption="Force Event for Auto CMD Index Error" mask="0x00000010" name="ACMDIDX"/>
          <bitfield caption="Force Event for Command Not Issued by Auto CMD12 Error" mask="0x00000080" name="CMDNI"/>
        </register>
        <register caption="Force Event Register for Error Interrupt Status" name="SDMMC_FEREIS" offset="0x52" rw="W" size="2" atomic-op="clear:SDMMC_FEREIS">
          <bitfield caption="Force Event for Command Timeout Error" mask="0x00000001" name="CMDTEO"/>
          <bitfield caption="Force Event for Command CRC Error" mask="0x00000002" name="CMDCRC"/>
          <bitfield caption="Force Event for Command End Bit Error" mask="0x00000004" name="CMDEND"/>
          <bitfield caption="Force Event for Command Index Error" mask="0x00000008" name="CMDIDX"/>
          <bitfield caption="Force Event for Data Timeout error" mask="0x00000010" name="DATTEO"/>
          <bitfield caption="Force Event for Data CRC error" mask="0x00000020" name="DATCRC"/>
          <bitfield caption="Force Event for Data End Bit Error" mask="0x00000040" name="DATEND"/>
          <bitfield caption="Force Event for Current Limit Error" mask="0x00000080" name="CURLIM"/>
          <bitfield caption="Force Event for Auto CMD Error" mask="0x00000100" name="ACMD"/>
          <bitfield caption="Force Event for ADMA Error" mask="0x00000200" name="ADMA"/>
          <bitfield caption="Force Event for Boot Acknowledge Error" mask="0x00001000" name="BOOTAE"/>
        </register>
        <register caption="ADMA Error Status Register" name="SDMMC_AESR" offset="0x54" rw="R" size="1">
          <bitfield caption="ADMA Error State" mask="0x00000003" name="ERRST"/>
          <bitfield caption="ADMA Length Mismatch Error" mask="0x00000004" name="LMIS"/>
        </register>
        <register caption="ADMA System Address Register 0" name="SDMMC_ASAR0" offset="0x58" rw="RW" size="4">
          <bitfield caption="ADMA System Address" mask="0xFFFFFFFF" name="ADMASA"/>
        </register>
        <register caption="Preset Value Register 0 (for initialization)" count="8" name="SDMMC_PVR" offset="0x60" rw="RW" size="2">
          <bitfield caption="SDCLK Frequency Select" mask="0x000003FF" name="SDCLKFSEL"/>
          <bitfield caption="Clock Generator Select" mask="0x00000400" name="CLKGSEL"/>
          <bitfield caption="Driver Strength Select" mask="0x0000C000" name="DRVSEL"/>
        </register>
        <register caption="Slot Interrupt Status Register" name="SDMMC_SISR" offset="0xFC" rw="R" size="2">
          <bitfield caption="Interrupt Signal for Each Slot" mask="0x00000003" name="INTSSL"/>
        </register>
        <register caption="Host Controller Version Register" name="SDMMC_HCVR" offset="0xFE" rw="R" size="2">
          <bitfield caption="Specification Version Number" mask="0x000000FF" name="SVER"/>
          <bitfield caption="Vendor Version Number" mask="0x0000FF00" name="VVER"/>
        </register>
        <register caption="Additional Present State Register" name="SDMMC_APSR" offset="0x200" rw="R" size="4">
          <bitfield caption="DAT[7:4] High Line Level" mask="0x0000000F" name="HDATLL"/>
        </register>
        <register caption="e.MMC Control 1 Register" name="SDMMC_MC1R" offset="0x204" rw="RW" size="1">
          <bitfield caption="e.MMC Command Type" mask="0x00000003" name="CMDTYP" values="SDMMC_MC1R__CMDTYP"/>
          <bitfield caption="e.MMC HSDDR Mode" mask="0x00000008" name="DDR"/>
          <bitfield caption="e.MMC Open Drain Mode" mask="0x00000010" name="OPD"/>
          <bitfield caption="e.MMC Boot Acknowledge Enable" mask="0x00000020" name="BOOTA"/>
          <bitfield caption="e.MMC Reset Signal" mask="0x00000040" name="RSTN"/>
          <bitfield caption="e.MMC Force Card Detect" mask="0x00000080" name="FCD"/>
        </register>
        <register caption="e.MMC Control 2 Register" name="SDMMC_MC2R" offset="0x205" rw="W" size="1">
          <bitfield caption="e.MMC Abort Wait IRQ" mask="0x00000001" name="SRESP"/>
          <bitfield caption="e.MMC Abort Boot" mask="0x00000002" name="ABOOT"/>
        </register>
        <register caption="AHB Control Register" name="SDMMC_ACR" offset="0x208" rw="RW" size="4">
          <bitfield caption="AHB Maximum Burst" mask="0x00000003" name="BMAX" values="SDMMC_ACR__BMAX"/>
        </register>
        <register caption="Clock Control 2 Register" name="SDMMC_CC2R" offset="0x20C" rw="RW" size="4">
          <bitfield caption="Force SDCLK Disabled" mask="0x00000001" name="FSDCLKD"/>
        </register>
        <register caption="Retuning Timer Control 1 Register" name="SDMMC_RTC1R" offset="0x210" rw="RW" size="1">
          <bitfield caption="Retuning Timer Enable" mask="0x00000001" name="TMREN" values="SDMMC_RTC1R__TMREN"/>
        </register>
        <register caption="Retuning Timer Control 2 Register" name="SDMMC_RTC2R" offset="0x211" rw="W" size="1">
          <bitfield caption="Retuning Timer Reload" mask="0x00000001" name="RLD"/>
        </register>
        <register caption="Retuning Timer Counter Value Register" name="SDMMC_RTCVR" offset="0x214" rw="RW" size="4">
          <bitfield caption="Retuning Timer Counter Value" mask="0x0000000F" name="TCVAL"/>
        </register>
