Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
      <value-group caption="Auto CMD Error Status Enable" name="SDMMC_EISTER__ACMD">
        <value caption="The ACMD status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ACMD status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Status Enable" name="SDMMC_EISTER__ADMA">
        <value caption="The ADMA status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ADMA status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDTEO">
        <value caption="The CMDTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command CRC Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDCRC">
        <value caption="The CMDCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command End Bit Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDEND">
        <value caption="The CMDEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Status Enable" name="SDMMC_EISTER_E_MMC__CMDIDX">
        <value caption="The CMDIDX status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDIDX status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Status Enable" name="SDMMC_EISTER_E_MMC__DATTEO">
        <value caption="The DATTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Status Enable" name="SDMMC_EISTER_E_MMC__DATCRC">
        <value caption="The DATCRC status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATCRC status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Status Enable" name="SDMMC_EISTER_E_MMC__DATEND">
        <value caption="The DATEND status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The DATEND status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Status Enable" name="SDMMC_EISTER_E_MMC__CURLIM">
        <value caption="The CURLIM status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CURLIM status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto CMD Error Status Enable" name="SDMMC_EISTER_E_MMC__ACMD">
        <value caption="The ACMD status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ACMD status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Status Enable" name="SDMMC_EISTER_E_MMC__ADMA">
        <value caption="The ADMA status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The ADMA status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Error Status Enable" name="SDMMC_EISTER_E_MMC__BOOTAE">
        <value caption="The BOOTAE status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The BOOTAE status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Complete Signal Enable" name="SDMMC_NISIER__CMDC">
        <value caption="No interrupt is generated when the CMDC status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDC status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Signal Enable" name="SDMMC_NISIER__TRFC">
        <value caption="No interrupt is generated when the TRFC status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the TRFC status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Gap Event Signal Enable" name="SDMMC_NISIER__BLKGE">
        <value caption="No interrupt is generated when the BLKGE status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BLKGE status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Signal Enable" name="SDMMC_NISIER__DMAINT">
        <value caption="No interrupt is generated when the DMAINT status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DMAINT status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Signal Enable" name="SDMMC_NISIER__BWRRDY">
        <value caption="No interrupt is generated when the BWRRDY status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BWRRDY status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Signal Enable" name="SDMMC_NISIER__BRDRDY">
        <value caption="No interrupt is generated when the BRDRDY status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BRDRDY status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Insertion Signal Enable" name="SDMMC_NISIER__CINS">
        <value caption="No interrupt is generated when the CINS status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CINS status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Removal Signal Enable" name="SDMMC_NISIER__CREM">
        <value caption="No interrupt is generated when the CREM status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CREM status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Interrupt Signal Enable" name="SDMMC_NISIER__CINT">
        <value caption="No interrupt is generated when the CINT status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CINT status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
