Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.5.42/atdf/ATSAMA5D24.atdf
      <value-group caption="Selection of the Control Signal for Write Operation" name="HSMC_MODE0__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal" name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="NWAIT Mode" name="HSMC_MODE0__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding Chip Select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="Byte Access Type" name="HSMC_MODE0__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="Data Bus Width" name="HSMC_MODE0__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="Page Size of the NAND Flash Device" name="HSMC_CFG__PAGESIZE">
        <value caption="Main area 512 bytes" name="PS512" value="0x0"/>
        <value caption="Main area 1024 bytes" name="PS1024" value="0x1"/>
        <value caption="Main area 2048 bytes" name="PS2048" value="0x2"/>
        <value caption="Main area 4096 bytes" name="PS4096" value="0x3"/>
        <value caption="Main area 8192 bytes" name="PS8192" value="0x4"/>
      </value-group>
      <value-group caption="Data Timeout Multiplier" name="HSMC_CFG__DTOMUL">
        <value caption="DTOCYC" name="X1" value="0x0"/>
        <value caption="DTOCYC x 16" name="X16" value="0x1"/>
        <value caption="DTOCYC x 128" name="X128" value="0x2"/>
        <value caption="DTOCYC x 256" name="X256" value="0x3"/>
        <value caption="DTOCYC x 1024" name="X1024" value="0x4"/>
        <value caption="DTOCYC x 4096" name="X4096" value="0x5"/>
        <value caption="DTOCYC x 65536" name="X65536" value="0x6"/>
        <value caption="DTOCYC x 1048576" name="X1048576" value="0x7"/>
      </value-group>
      <value-group caption="Error Correcting Capability" name="HSMC_PMECCFG__BCH_ERR">
        <value caption="2 errors" name="BCH_ERR2" value="0x0"/>
        <value caption="4 errors" name="BCH_ERR4" value="0x1"/>
        <value caption="8 errors" name="BCH_ERR8" value="0x2"/>
        <value caption="12 errors" name="BCH_ERR12" value="0x3"/>
        <value caption="24 errors" name="BCH_ERR24" value="0x4"/>
        <value caption="32 errors" name="BCH_ERR32" value="0x5"/>
      </value-group>
      <value-group caption="Error Correcting Capability" name="HSMC_PMECCFG__SECTORSZ">
        <value caption="Use  512 Byte Sector in ECC Computation" name="SECTORSZ0" value="0x0"/>
        <value caption="Use 1024 Byte Sector in ECC Computation" name="SECTORSZ1" value="0x1"/>
      </value-group>
      <value-group caption="Error Location Capability" name="HSMC_ELCFG__SECTORSZ">
        <value caption="Use  512 Byte Sector in Location Computation" name="SECTORSZ0" value="0x0"/>
        <value caption="Use 1024 Byte Sector in Location Computation" name="SECTORSZ1" value="0x1"/>
      </value-group>
      <value-group caption="Number of Sectors in the Page" name="HSMC_PMECCFG__PAGESIZE">
        <value caption="1 sector for main area (512 or 1024 bytes)" name="PAGESIZE_1SEC" value="0x0"/>
        <value caption="2 sectors for main area (1024 or 2048 bytes)" name="PAGESIZE_2SEC" value="0x1"/>
        <value caption="4 sectors for main area (2048 or 4096 bytes)" name="PAGESIZE_4SEC" value="0x2"/>
        <value caption="8 sectors for main area (4096 or 8192 bytes)" name="PAGESIZE_8SEC" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="HSMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" id="6088" name="SPI" version="ZR">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x00010000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x00020000" name="RXFCLR"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR" values="SPI_MR__MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00000008" name="BRSRCCLK" values="SPI_MR__BRSRCCLK"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="LSB Timing Selection" mask="0x00000100" name="LSBHALF"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="SPI_MR__CMPMODE"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" values="SPI_MR__PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <mode name="DEFAULT" qualifier="SPI_FIFO_ONE_DATA_RX.SPI_FMR.RXRDYM" value="0x0" caption="RX SPI FIFO Single Data"/>
          <mode name="FIFO_MULTI_DATA_8" qualifier="SPI_FIFO_TWO_DATA_RX.SPI_FMR.RXRDYM" value="0x1" caption="RX SPI FIFO Multi Data - 8-bit"/>
          <mode name="FIFO_MULTI_DATA_16" qualifier="SPI_FIFO_FOUR_DATA_RX.SPI_FMR.RXRDYM" value="0x2" caption="RX SPI FIFO Multi Data - 16-bit"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" modes="DEFAULT" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" modes="DEFAULT" name="PCS"/>
          <bitfield caption="Receive Data" mask="0x000000FF" modes="FIFO_MULTI_DATA_8" name="RD8_0"/>
          <bitfield caption="Receive Data" mask="0x0000FF00" modes="FIFO_MULTI_DATA_8" name="RD8_1"/>
          <bitfield caption="Receive Data" mask="0x00FF0000" modes="FIFO_MULTI_DATA_8" name="RD8_2"/>
          <bitfield caption="Receive Data" mask="0xFF000000" modes="FIFO_MULTI_DATA_8" name="RD8_3"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" modes="FIFO_MULTI_DATA_16" name="RD16_0"/>
          <bitfield caption="Receive Data" mask="0xFFFF0000" modes="FIFO_MULTI_DATA_16" name="RD16_1"/>
        </register>
